app/views/home/item_detail.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
    <body onload="initialize()">
        <b>uploaded by <%= User.where(id: @item.f_id).first.email %></b>